---
kind: enumMember
id: F:Autodesk.Revit.UI.EditorInteractionType.Dismiss
enum: Autodesk.Revit.UI.EditorInteractionType
source: html/5dba951f-9d86-4205-a829-be4df4ad200d.htm
---
# Autodesk.Revit.UI.EditorInteractionType.Dismiss

Dismiss the active editor during pane activation.
 This results in the current selection being cleared and the editor canceled.
One example built-in dockable pane that uses this mode is the Revit Project Browser.